; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	infrared2 - mode
	spectrograph1 - mode
	thermograph0 - mode
	Star1 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	Star3 - direction
	Planet4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star1)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet4)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 137)
	(= (data Star3 infrared2) 116)
	(= (data Planet4 infrared2) 154)
	(= (data Phenomenon5 infrared2) 154)
	(= (data Star6 infrared2) 108)
	(= (data Star7 infrared2) 121)
	(= (data Star3 spectrograph1) 290)
	(= (data Planet4 spectrograph1) 24)
	(= (data Phenomenon5 spectrograph1) 39)
	(= (data Star6 spectrograph1) 113)
	(= (data Star7 spectrograph1) 254)
	(= (data Star3 thermograph0) 18)
	(= (data Planet4 thermograph0) 118)
	(= (data Phenomenon5 thermograph0) 71)
	(= (data Star6 thermograph0) 21)
	(= (data Star7 thermograph0) 166)
	(= (slew_time Star1 GroundStation0) 16.39)
	(= (slew_time GroundStation0 Star1) 16.39)
	(= (slew_time GroundStation2 GroundStation0) 1.94)
	(= (slew_time GroundStation0 GroundStation2) 1.94)
	(= (slew_time GroundStation2 Star1) 23.95)
	(= (slew_time Star1 GroundStation2) 23.95)
	(= (slew_time Star3 GroundStation0) 2.297)
	(= (slew_time GroundStation0 Star3) 2.297)
	(= (slew_time Star3 Star1) 89.7)
	(= (slew_time Star1 Star3) 89.7)
	(= (slew_time Star3 GroundStation2) 12.73)
	(= (slew_time GroundStation2 Star3) 12.73)
	(= (slew_time Planet4 GroundStation0) 48.71)
	(= (slew_time GroundStation0 Planet4) 48.71)
	(= (slew_time Planet4 Star1) 15.36)
	(= (slew_time Star1 Planet4) 15.36)
	(= (slew_time Planet4 GroundStation2) 10.35)
	(= (slew_time GroundStation2 Planet4) 10.35)
	(= (slew_time Planet4 Star3) 21.18)
	(= (slew_time Star3 Planet4) 21.18)
	(= (slew_time Phenomenon5 GroundStation0) 7.687)
	(= (slew_time GroundStation0 Phenomenon5) 7.687)
	(= (slew_time Phenomenon5 Star1) 54.03)
	(= (slew_time Star1 Phenomenon5) 54.03)
	(= (slew_time Phenomenon5 GroundStation2) 46.16)
	(= (slew_time GroundStation2 Phenomenon5) 46.16)
	(= (slew_time Phenomenon5 Star3) 45.53)
	(= (slew_time Star3 Phenomenon5) 45.53)
	(= (slew_time Phenomenon5 Planet4) 11.88)
	(= (slew_time Planet4 Phenomenon5) 11.88)
	(= (slew_time Star6 GroundStation0) 17.41)
	(= (slew_time GroundStation0 Star6) 17.41)
	(= (slew_time Star6 Star1) 15.84)
	(= (slew_time Star1 Star6) 15.84)
	(= (slew_time Star6 GroundStation2) 3.422)
	(= (slew_time GroundStation2 Star6) 3.422)
	(= (slew_time Star6 Star3) 14.34)
	(= (slew_time Star3 Star6) 14.34)
	(= (slew_time Star6 Planet4) 56.96)
	(= (slew_time Planet4 Star6) 56.96)
	(= (slew_time Star6 Phenomenon5) 30.88)
	(= (slew_time Phenomenon5 Star6) 30.88)
	(= (slew_time Star7 GroundStation0) 74.21)
	(= (slew_time GroundStation0 Star7) 74.21)
	(= (slew_time Star7 Star1) 46.19)
	(= (slew_time Star1 Star7) 46.19)
	(= (slew_time Star7 GroundStation2) 49.77)
	(= (slew_time GroundStation2 Star7) 49.77)
	(= (slew_time Star7 Star3) 9.466)
	(= (slew_time Star3 Star7) 9.466)
	(= (slew_time Star7 Planet4) 26.17)
	(= (slew_time Planet4 Star7) 26.17)
	(= (slew_time Star7 Phenomenon5) 21.45)
	(= (slew_time Phenomenon5 Star7) 21.45)
	(= (slew_time Star7 Star6) 16.04)
	(= (slew_time Star6 Star7) 16.04)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 Star3)
	(have_image Star3 thermograph0)
	(have_image Planet4 spectrograph1)
	(have_image Phenomenon5 thermograph0)
	(have_image Star6 thermograph0)
	(have_image Star7 spectrograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite0 groundstation2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 137 to 126.65, (fuel-used) from 0 to 10.35
   goals met: 0 of 6
2. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 126.65 to 124.71, (fuel-used) from 10.35 to 12.29
   goals met: 0 of 6
3. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 star3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 124.71 to 122.413, (fuel-used) from 12.29 to 14.587
   goals met: 1 of 6
5. (turn_to satellite0 groundstation0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 122.413 to 120.116, (fuel-used) from 14.587 to 16.884
   goals met: 0 of 6
6. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 120.116 to 118.176, (fuel-used) from 16.884 to 18.824
   goals met: 0 of 6
7. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 118.176 to 116.236, (fuel-used) from 18.824 to 20.764
   goals met: 0 of 6
8. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 0 of 6
9. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 6
10. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 6
11. (turn_to satellite0 star3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 116.236 to 113.939, (fuel-used) from 20.764 to 23.061
   goals met: 1 of 6
12. (turn_to satellite0 groundstation0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 113.939 to 111.642, (fuel-used) from 23.061 to 25.358
   goals met: 0 of 6
13. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 111.642 to 109.702, (fuel-used) from 25.358 to 27.298
   goals met: 0 of 6
14. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 109.702 to 107.762, (fuel-used) from 27.298 to 29.238
   goals met: 0 of 6
15. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 107.762 to 105.822, (fuel-used) from 29.238 to 31.178
   goals met: 0 of 6
16. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 105.822 to 103.882, (fuel-used) from 31.178 to 33.118
   goals met: 0 of 6
17. (turn_to satellite0 phenomenon5 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon5)
   changed: (fuel satellite0) from 103.882 to 96.195, (fuel-used) from 33.118 to 40.805
   goals met: 0 of 6
18. (take_image satellite0 phenomenon5 instrument2 thermograph0)
   added: (have_image phenomenon5 thermograph0)
   changed: (data_capacity satellite0) from 1000 to 929, (data-stored) from 0 to 71
   goals met: 1 of 6
19. (turn_to satellite0 groundstation0 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 96.195 to 88.508, (fuel-used) from 40.805 to 48.492
   goals met: 1 of 6
20. (turn_to satellite0 star3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 88.508 to 86.211, (fuel-used) from 48.492 to 50.789
   goals met: 2 of 6
21. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 6
22. (switch_on instrument2 satellite0)
   deleted: (calibrated instrument2) (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 2 of 6
23. (turn_to satellite0 groundstation0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 86.211 to 83.914, (fuel-used) from 50.789 to 53.086
   goals met: 1 of 6
24. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 83.914 to 81.974, (fuel-used) from 53.086 to 55.026
   goals met: 1 of 6
25. (turn_to satellite0 star6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 81.974 to 78.552, (fuel-used) from 55.026 to 58.448
   goals met: 1 of 6
26. (turn_to satellite0 groundstation2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 78.552 to 75.13, (fuel-used) from 58.448 to 61.87
   goals met: 1 of 6
27. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 1 of 6
28. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 6
29. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 1 of 6
30. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 1 of 6
31. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 6
32. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 75.13 to 73.19, (fuel-used) from 61.87 to 63.81
   goals met: 1 of 6
33. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 6
34. (turn_to satellite0 star6 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star6)
   changed: (fuel satellite0) from 73.19 to 55.78, (fuel-used) from 63.81 to 81.22
   goals met: 1 of 6
35. (take_image satellite0 star6 instrument2 thermograph0)
   added: (have_image star6 thermograph0)
   changed: (data_capacity satellite0) from 929 to 908, (data-stored) from 71 to 92
   goals met: 2 of 6
36. (turn_to satellite0 groundstation2 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 55.78 to 52.358, (fuel-used) from 81.22 to 84.642
   goals met: 2 of 6
37. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 2 of 6
38. (switch_on instrument1 satellite0)
   deleted: (calibrated instrument1) (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 6
39. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 2 of 6
40. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 52.358 to 50.418, (fuel-used) from 84.642 to 86.582
   goals met: 2 of 6
41. (turn_to satellite0 star3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 50.418 to 48.121, (fuel-used) from 86.582 to 88.879
   goals met: 3 of 6
42. (turn_to satellite0 star7 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star7)
   changed: (fuel satellite0) from 48.121 to 38.655, (fuel-used) from 88.879 to 98.345
   goals met: 2 of 6
43. (take_image satellite0 star7 instrument1 spectrograph1)
   added: (have_image star7 spectrograph1)
   changed: (data_capacity satellite0) from 908 to 654, (data-stored) from 92 to 346
   goals met: 3 of 6
44. (turn_to satellite0 star3 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 38.655 to 29.189, (fuel-used) from 98.345 to 107.811
   goals met: 4 of 6
45. (turn_to satellite0 groundstation0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 29.189 to 26.892, (fuel-used) from 107.811 to 110.108
   goals met: 3 of 6
46. (turn_to satellite0 groundstation2 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 26.892 to 24.952, (fuel-used) from 110.108 to 112.048
   goals met: 3 of 6
47. (turn_to satellite0 planet4 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet4)
   changed: (fuel satellite0) from 24.952 to 14.602, (fuel-used) from 112.048 to 122.398
   goals met: 3 of 6
48. (take_image satellite0 planet4 instrument1 spectrograph1)
   added: (have_image planet4 spectrograph1)
   changed: (data_capacity satellite0) from 654 to 630, (data-stored) from 346 to 370
   goals met: 4 of 6
49. (turn_to satellite0 groundstation2 planet4)
   deleted: (pointing satellite0 planet4)
   added: (pointing satellite0 groundstation2)
   changed: (fuel satellite0) from 14.602 to 4.252, (fuel-used) from 122.398 to 132.748
   goals met: 4 of 6
50. (turn_to satellite0 groundstation0 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 groundstation0)
   changed: (fuel satellite0) from 4.252 to 2.312, (fuel-used) from 132.748 to 134.688
   goals met: 4 of 6
51. (turn_to satellite0 star3 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star3)
   changed: (fuel satellite0) from 2.312 to 0.015, (fuel-used) from 134.688 to 136.985
   goals met: 5 of 6
52. (take_image satellite0 star3 instrument1 thermograph0)
   added: (have_image star3 thermograph0)
   changed: (data_capacity satellite0) from 630 to 612, (data-stored) from 370 to 388
   goals met: 6 of 6
